In [12]:
import numpy as np
import pandas as pd
import seaborn as sns

import warnings
warnings.simplefilter(action='ignore')

# Grafik Ayarlari
# Arka tarf cizgili olur
sns.set_theme(style="whitegrid")

In [16]:
df = pd.read_csv('/Users/macbook/Desktop/projects/Github_Repositories/Trainings/Data_Preprocessing/forbes_2022_billionaires.csv')
df.head()

,rank,personName,age,finalWorth,year,month,category,source,country,state,...,organization,selfMade,gender,birthDate,title,philanthropyScore,residenceMsa,numberOfSiblings,bio,about
0,1,Elon Musk,50.0,219000.0,2022,4,Automotive,"Tesla, SpaceX",United States,Texas,...,Tesla,True,M,1971-06-28,CEO,1.0,NaN,NaN,Elon Musk is working to revolutionize transpor...,Musk was accepted to a graduate program at Sta...
1,2,Jeff Bezos,58.0,171000.0,2022,4,Technology,Amazon,United States,Washington,...,Amazon,True,M,1964-01-12,Entrepreneur,1.0,"Seattle-Tacoma-Bellevue, WA",NaN,Jeff Bezos founded e-commerce giant Amazon in ...,"Growing up, Jeff Bezos worked summers on his g..."
2,3,Bernard Arnault & family,73.0,158000.0,2022,4,Fashion & Retail,LVMH,France,NaN,...,LVMH Moët Hennessy Louis Vuitton,False,M,1949-03-05,Chairman and CEO,NaN,NaN,NaN,Bernard Arnault oversees the LVMH empire of so...,"Arnault apparently wooed his wife, Helene Merc..."
3,4,Bill Gates,66.0,129000.0,2022,4,Technology,Microsoft,United States,Washington,...,Bill & Melinda Gates Foundation,True,M,1955-10-28,Cofounder,4.0,"Seattle-Tacoma-Bellevue, WA",NaN,Bill Gates turned his fortune from software fi...,"When Gates was a kid, he spent so much time re..."
4,5,Warren Buffett,91.0,118000.0,2022,4,Finance & Investments,Berkshire Hathaway,United States,Nebraska,...,Berkshire Hathaway,True,M,1930-08-30,CEO,5.0,"Omaha, NE",NaN,"Known as the ""Oracle of Omaha,"" Warren Buffett...","Buffett still lives in the same Omaha, Nebrask..."

In [17]:
df.columns

Index(['rank', 'personName', 'age', 'finalWorth', 'year', 'month', 'category',
       'source', 'country', 'state', 'city', 'countryOfCitizenship',
       'organization', 'selfMade', 'gender', 'birthDate', 'title',
       'philanthropyScore', 'residenceMsa', 'numberOfSiblings', 'bio',
       'about'],
      dtype='object')

In [18]:
df.loc[:,['rank', 'personName' ,'finalWorth']]

      rank                personName  finalWorth
0        1                 Elon Musk    219000.0
1        2                Jeff Bezos    171000.0
2        3  Bernard Arnault & family    158000.0
3        4                Bill Gates    129000.0
4        5            Warren Buffett    118000.0
...    ...                       ...         ...
2663  2578             Zhang Yuqiang      1000.0
2664  2578                Zhou Ruxin      1000.0
2665  2578         Wen Zhou & family      1000.0
2666  2578      Zhou Yifeng & family      1000.0
2667  2578   Zhuang Kuilong & family      1000.0

[2668 rows x 3 columns]

In [29]:
df = df.rename(columns = {'rank': 'Sira',
                    'personName' : 'Name'})
df.head()

,Name,age,finalWorth,year,month,category,source,country,state,city,...,organization,selfMade,gender,birthDate,title,philanthropyScore,residenceMsa,numberOfSiblings,bio,about
Sira,,,,,,,,,,,,,,,,,,,,,
1,Elon Musk,50.0,219000.0,2022,4,Automotive,"Tesla, SpaceX",United States,Texas,Austin,...,Tesla,True,M,1971-06-28,CEO,1.0,NaN,NaN,Elon Musk is working to revolutionize transpor...,Musk was accepted to a graduate program at Sta...
2,Jeff Bezos,58.0,171000.0,2022,4,Technology,Amazon,United States,Washington,Seattle,...,Amazon,True,M,1964-01-12,Entrepreneur,1.0,"Seattle-Tacoma-Bellevue, WA",NaN,Jeff Bezos founded e-commerce giant Amazon in ...,"Growing up, Jeff Bezos worked summers on his g..."
3,Bernard Arnault & family,73.0,158000.0,2022,4,Fashion & Retail,LVMH,France,NaN,Paris,...,LVMH Moët Hennessy Louis Vuitton,False,M,1949-03-05,Chairman and CEO,NaN,NaN,NaN,Bernard Arnault oversees the LVMH empire of so...,"Arnault apparently wooed his wife, Helene Merc..."
4,Bill Gates,66.0,129000.0,2022,4,Technology,Microsoft,United States,Washington,Medina,...,Bill & Melinda Gates Foundation,True,M,1955-10-28,Cofounder,4.0,"Seattle-Tacoma-Bellevue, WA",NaN,Bill Gates turned his fortune from software fi...,"When Gates was a kid, he spent so much time re..."
5,Warren Buffett,91.0,118000.0,2022,4,Finance & Investments,Berkshire Hathaway,United States,Nebraska,Omaha,...,Berkshire Hathaway,True,M,1930-08-30,CEO,5.0,"Omaha, NE",NaN,"Known as the ""Oracle of Omaha,"" Warren Buffett...","Buffett still lives in the same Omaha, Nebrask..."

In [24]:
df.index

RangeIndex(start=0, stop=2668, step=1)

In [32]:
df = df.set_index('Sira')
df.index

Int64Index([   1,    2,    3,    4,    5,    6,    7,    8,    9,   10,
            ...
            2578, 2578, 2578, 2578, 2578, 2578, 2578, 2578, 2578, 2578],
           dtype='int64', name='Sira', length=2668)

In [35]:
df.isnull().sum()

Name                       0
age                       86
finalWorth                 0
year                       0
month                      0
category                   0
source                     0
country                   13
state                   1920
city                      44
countryOfCitizenship       0
organization            2316
selfMade                   0
gender                    16
birthDate                 99
title                   2267
philanthropyScore       2272
residenceMsa            2029
numberOfSiblings        2541
bio                        0
about                   1106
dtype: int64

In [41]:
df['state'].unique()

array(['Texas', 'Washington', nan, 'Nebraska', 'California', 'Hawaii',
       'New York', 'Arkansas', 'Kansas', 'Oregon', 'Virginia', 'Wyoming',
       'Nevada', 'Illinois', 'Connecticut', 'Michigan', 'Tennessee',
       'Massachusetts', 'Florida', 'Oklahoma', 'Wisconsin',
       'Pennsylvania', 'Indiana', 'Colorado', 'Missouri', 'Georgia',
       'Arizona', 'Kentucky', 'North Carolina', 'Iowa', 'Montana',
       'New Jersey', 'Maryland', 'Ohio', 'Louisiana', 'South Dakota',
       'Utah', 'Idaho', 'Maine', 'Minnesota', 'Rhode Island',
       'Mississippi', 'South Carolina'], dtype=object)

In [42]:
# df.dropna(inplace= True)

In [44]:
df['gender'].value_counts()

M    2341
F     311
Name: gender, dtype: int64

In [46]:
df['gender'].value_counts(normalize= True)

M    0.88273
F    0.11727
Name: gender, dtype: float64

In [48]:
df['country'] == 'Turkey'

Sira
1       False
2       False
3       False
4       False
5       False
        ...
2578    False
2578    False
2578    False
2578    False
2578    False
Name: country, Length: 2668, dtype: bool

In [57]:
df[df['country'] == 'Turkey'].shape

(23, 21)

In [53]:
df[df['country'] == 'Turkey']['country'].value_counts()

Turkey    23
Name: country, dtype: int64

In [55]:
df[df['country'] == 'Turkey'].country.value_counts(normalize= True)

Turkey    1.0
Name: country, dtype: float64